src/InformationRegisters/Титаник.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>Титаник</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выживание</Name>
					<Type>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Класс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Пол</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРодственниковПервогоПорядка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРодственниковВторогоПорядка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортПосадки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Каюта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/Выживание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Enum>
		<Properties>
			<Name>Выживание</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выжил</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВыжил</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/Класс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Enum>
		<Properties>
			<Name>Класс</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Первый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Второй</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Третий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/Пол.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Enum>
		<Properties>
			<Name>Пол</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>М</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ж</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ПортПосадки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Enum>
		<Properties>
			<Name>ПортПосадки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Cherbourg</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Queenstown</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Southampton</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/Титаник/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьДанными(Команда)
	ЗаполнитьДаннымиНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиНаСервере()
	
	// Очистим данные
	НаборЗаписей = РегистрыСведений.Титаник.СоздатьНаборЗаписей();
	НаборЗаписей.Записать(Истина);
	
	Макет = РегистрыСведений.Титаник.ПолучитьМакет("ТренировочныйНабор");
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Идентификатор = Число(Макет.Область(НомерСтроки, 1).Текст);
		Если ЗначениеЗаполнено(Макет.Область(НомерСтроки, 2).Текст) Тогда
			НоваяЗапись.Выживание = ?(Макет.Область(НомерСтроки, 2).Текст = "1", Перечисления.Выживание.Выжил, Перечисления.Выживание.НеВыжил);
		КонецЕсли;
		Если Макет.Область(НомерСтроки, 3).Текст = "1" Тогда
			НоваяЗапись.Класс = Перечисления.Класс.Первый;
		ИначеЕсли Макет.Область(НомерСтроки, 3).Текст = "2" Тогда
			НоваяЗапись.Класс = Перечисления.Класс.Второй;
		ИначеЕсли Макет.Область(НомерСтроки, 3).Текст = "3" Тогда
			НоваяЗапись.Класс = Перечисления.Класс.Третий;
		КонецЕсли;
		НоваяЗапись.Имя = Макет.Область(НомерСтроки, 4).Текст;
		Если Макет.Область(НомерСтроки, 5).Текст = "male" Тогда
			НоваяЗапись.Пол = Перечисления.Пол.М;	
		ИначеЕсли Макет.Область(НомерСтроки, 5).Текст = "female" Тогда
			НоваяЗапись.Пол = Перечисления.Пол.Ж;
		КонецЕсли;		
		Попытка
			НоваяЗапись.Возраст = Число(Макет.Область(НомерСтроки, 6).Текст);
		Исключение
		КонецПопытки;
		НоваяЗапись.КоличествоРодственниковВторогоПорядка = Число(Макет.Область(НомерСтроки, 7).Текст);
		НоваяЗапись.КоличествоРодственниковПервогоПорядка = Число(Макет.Область(НомерСтроки, 8).Текст);
		НоваяЗапись.НомерБилета = Макет.Область(НомерСтроки, 9).Текст;
		Попытка
			НоваяЗапись.Тариф = Число(Макет.Область(НомерСтроки, 10).Текст);
		Исключение
		КонецПопытки;
		НоваяЗапись.Каюта = Макет.Область(НомерСтроки, 11).Текст;
		Если Макет.Область(НомерСтроки, 12).Текст = "C" Тогда
			НоваяЗапись.ПортПосадки = Перечисления.ПортПосадки.Cherbourg;
		ИначеЕсли Макет.Область(НомерСтроки, 12).Текст = "Q" Тогда
			НоваяЗапись.ПортПосадки = Перечисления.ПортПосадки.Queenstown;
		ИначеЕсли Макет.Область(НомерСтроки, 12).Текст = "S" Тогда
			НоваяЗапись.ПортПосадки = Перечисления.ПортПосадки.Southampton;	
		КонецЕсли;
	КонецЦикла;
	НаборЗаписей.Записать();
		
КонецПроцедуры
